//Extract alert name and rule for security incidents
SecurityAlert
| extend Extendido=todynamic(ExtendedProperties)
| extend AlertaGerado = Extendido.["Alert generation status"]
| extend Regra = Extendido.["Analytic Rule Name"]


//Extract folder and size of email. Example to access multiple array in logs
OfficeActivity 
| where Operation == "MailItemsAccessed"
| extend Propriedades = parse_json(Folders)
| extend Pasta        = Propriedades[0].Path
| extend Tamanho      = Propriedades[0].FolderItems[0].SizeInBytes
| project Operation, Pasta, Tamanho, Propriedades


//Extract a specific data in string
SecurityEvent
| extend Evento = extract("<RuleName>(.*)</RuleName>", 1, EventData)
| project Computer, Evento, EventData

//Use of variables and extract specific string
let Servico="MICROSOFT.SQL";
let Tempo=ago(60d);
AzureMetrics
| where ResourceProvider == Servico
| where TimeGenerated >=Tempo
| where MetricName in ('deadlock')
| parse _ResourceId with * "/microsoft.sql/servers/" Resource // subtract Resource name for _ResourceId
| summarize Deadlock_max_60Mins = max(Maximum) by Resource, MetricName

//Extract specific data in string
AzureMetrics
| extend Servidor=extract("/SERVERS/(.*)/DATABASES/", 1, ResourceId)
| extend Banco   =extract("/DATABASES/(.*)", 1, ResourceId)
| where isnotempty(Servidor) 
| project Servidor, Banco, ResourceId
